{"keras_version": "2.2.4", "config": {"layers": [{"config": {"kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dtype": "float32", "dilation_rate": [1, 1], "use_bias": true, "batch_input_shape": [null, 28, 28, 1], "filters": 20, "activation": "linear", "kernel_size": [5, 5], "data_format": "channels_last", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "activity_regularizer": null, "bias_constraint": null, "name": "conv1", "bias_regularizer": null, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "trainable": true, "name": "maxpool1"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "use_bias": true, "filters": 50, "activation": "linear", "kernel_size": [5, 5], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "activity_regularizer": null, "bias_constraint": null, "name": "conv2", "bias_regularizer": null, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "trainable": true, "name": "maxpool2"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "use_bias": true, "units": 500, "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "name": "dense_1", "bias_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_3"}, "class_name": "Activation"}, {"config": {"kernel_constraint": null, "use_bias": true, "units": 10, "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "name": "outputlayer", "bias_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "softmax", "name": "activation_4"}, "class_name": "Activation"}], "name": "sequential_1"}, "class_name": "Sequential", "backend": "tensorflow"}