{"config": {"layers": [{"config": {"kernel_regularizer": null, "name": "conv1", "padding": "same", "kernel_size": [5, 5], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "filters": 20, "data_format": "channels_last", "use_bias": true, "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"data_format": "channels_last", "strides": [2, 2], "padding": "valid", "trainable": true, "name": "maxpool1", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"kernel_regularizer": null, "name": "conv2", "padding": "same", "kernel_size": [5, 5], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "filters": 50, "activation": "linear", "data_format": "channels_last", "use_bias": true, "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"data_format": "channels_last", "strides": [2, 2], "padding": "valid", "trainable": true, "name": "maxpool2", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_regularizer": null, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 500, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "use_bias": true, "trainable": true, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_3", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"kernel_regularizer": null, "name": "outputlayer", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 2, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "use_bias": true, "trainable": true, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_4", "activation": "softmax", "trainable": true}, "class_name": "Activation"}], "name": "sequential_1"}, "keras_version": "2.2.4", "class_name": "Sequential", "backend": "tensorflow"}